<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5c188d398a8dce16fb0709bc622a26324f2972153b4597f1840700b3941e9e76","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1363 at https://github.com/cal-itp/data-infra/actions/runs/21013178743","plan_out_hash":"cbc7cf551cf377905931c9f6d4d56fcd275c1c91593c75717563e69e2bbf6764","plan_hash":"796da29a1d9807d3effab9705b4095776af7b4d9a8a806c44c075bb4a243a687","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/operators/blackcat_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "s7BJ7Q==" -> (known after apply)
!~      detect_md5hash      = "husvfrVLOwWESpUczaAT3w==" -> "different hash"
!~      generation          = 1764102805638511 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/blackcat_to_gcs_operator.py"
!~      md5hash             = "husvfrVLOwWESpUczaAT3w==" -> (known after apply)
        name                = "plugins/operators/blackcat_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1363](https://github.com/cal-itp/data-infra/actions/runs/21013178743)